Omar-Magdy0/EcoDrive/platform/stm32f4/eldriver/eldriver_mc3p.c
#include "stm32f4xx_ll_adc.h"
#include "stm32f4xx_ll_tim.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_tim.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_gpio.h"
#include "stm32f401xc.h"

#include "eldriver_conf.h"
#include "eldriver_mc3p.h"


#define SATURATE(v , min , max)(( v > max)?max: ((v < min)?0:v))
#define Q15_HALF        16384   // 0.5 × 32768
#define Q15_SQRT3_BY_2  28378   // 0.8660254 × 32768

#define CC1E_MASK       (TIM_CCER_CC1E)
#define CC2E_MASK       (TIM_CCER_CC2E)
#define CC3E_MASK       (TIM_CCER_CC3E)
#define CC1NE_MASK      (TIM_CCER_CC1NE)
#define CC2NE_MASK      (TIM_CCER_CC2NE)
#define CC3NE_MASK      (TIM_CCER_CC3NE)

#define OC1M_MASK       (0b111 << TIM_CCMR1_OC1M_Pos)
#define OC1M_PWM        (0b110 << TIM_CCMR1_OC1M_Pos)
#define OC1M_ACTIVE     (0b101 << TIM_CCMR1_OC1M_Pos)
#define OC1M_INACTIVE   (0b100 << TIM_CCMR1_OC1M_Pos)

#define OC2M_MASK       (0b111 << TIM_CCMR1_OC2M_Pos)
#define OC2M_PWM        (0b110 << TIM_CCMR1_OC2M_Pos)
#define OC2M_ACTIVE     (0b101 << TIM_CCMR1_OC2M_Pos)
#define OC2M_INACTIVE   (0b100 << TIM_CCMR1_OC2M_Pos)

#define OC3M_MASK       (0b111 << TIM_CCMR2_OC3M_Pos)
#define OC3M_PWM        (0b110 << TIM_CCMR2_OC3M_Pos)
#define OC3M_ACTIVE     (0b101 << TIM_CCMR2_OC3M_Pos)
#define OC3M_INACTIVE   (0b100 << TIM_CCMR2_OC3M_Pos)

#ifndef ELDRIVER_MC3P_CS
#define ELDRIVER_MC3P_CS ELDRIVER_MC3P_CS_NONE
#endif

#if ELDRIVER_MC3P_CS == ELDRIVER_MC3P_CS_TRIPLE_SHUNT
#pragma message "CURRENT SENSOR : TRIPLE SHUNT"
#elif ELDRIVER_MC3P_CS == ELDRIVER_MC3P_CS_DOUBLE_SHUNT
#pragma message "CURRENT SENSOR : DOUBLE SHUNT"
#elif ELDRIVER_MC3P_CS == ELDRIVER_MC3P_CS_SINGLE_SHUNT
#pragma message "CURRENT SENSOR : SINGLE SHUNT"
#elif ELDRIVER_MC3P_CS == ELDRIVER_MC3P_CS_NONE
#pragma message "CURRENT SENSOR : NONE"
#elif ELDRIVER_MC3P_CS == ELDRIVER_MC3P_CS_INLINE
#pragma message "CURRENT SENSOR : INLINE"
#endif

//================================================================
// MCU Family Dependent LAYER GLOBALS and Definitions
//================================================================

//MCU LINE SPECIFIC DEFINES
#define VREFIN_CAL_ADDR (uint16_t *)0x1FFF7A2A
#define VREFIN_CAL_VOLTAGE 3.3f

#ifdef ELDRIVER_MC3P_EXTERNAL_VREF
const float externalRefVoltage_V = ELDRIVER_MC3P_VREFEXT_VOLTAGE;
#else
const float externalRefVoltage_V = 0;
#endif


//======================================================
//DMA static definitions for ADC
uint16_t mc3p_bg_data[2][ELDRIVER_MC3P_BG_CHANNELS];
float mc3p_bg_data_V[ELDRIVER_MC3P_BG_CHANNELS];
static volatile uint8_t mc3p_bg_active_buffer = 0; // 0 or 1
volatile uint8_t isReady = 0;


void mc3p_adc_svm_update(eldriver_mc3p_t *h, eldriver_mc3p_sector_t sector);
void mc3p_adc_trap_update(eldriver_mc3p_t *h, eldriver_mc3p_sector_t sector);
void mc3p_adc_mode(eldriver_mc3p_t *h, eldriver_mc3p_sector_t sector);

//=========================================
// Adc Single Sample Function
//==========================================
uint16_t adc1_Sample_Single_Channel_Temporary(uint32_t channel)
{
    // Save current configuration
    uint32_t old_sqr1 = ADC1->SQR1;
    uint32_t old_sqr2 = ADC1->SQR2;
    uint32_t old_sqr3 = ADC1->SQR3;
    
    // Configure for single conversion
    // Configure for single conversion USING LL FUNCTION
    LL_ADC_REG_SetSequencerLength(ADC1, LL_ADC_REG_SEQ_SCAN_DISABLE); // 1 conversion
    LL_ADC_REG_SetSequencerRanks(ADC1, LL_ADC_REG_RANK_1, channel);   // Handles conversion 
    
    // Start conversion
    LL_ADC_REG_StartConversionSWStart(ADC1);
    while (!LL_ADC_IsActiveFlag_EOCS(ADC1));
    uint16_t result = LL_ADC_REG_ReadConversionData12(ADC1);
    
    // Restore original configuration
    ADC1->SQR1 = old_sqr1;
    ADC1->SQR2 = old_sqr2;
    ADC1->SQR3 = old_sqr3;
    
    return result;
}

float mc3p_adc_read_single(eldriver_mc3p_t *h, uint32_t channel)
{
  uint16_t readVal = adc1_Sample_Single_Channel_Temporary(channel);
  return ((float)(readVal)/( 1<< ELDRIVER_MC3P_ADCRES)) * h->adc_ref_V;
}

//=========================================
// AdcCalibrate Function
//==========================================
void mc3p_adc_calibrate(eldriver_mc3p_t *h)
{
    //Enable VREFINT and internalTEMP sensor
    ADC->CCR |= ADC_CCR_TSVREFE_Msk;
    #ifndef ELDRIVER_MC3P_VREFEXT

    // Wait for internal references to stabilize (IMPORTANT!)
    volatile uint32_t wait = 10000;
    while(wait){wait = wait - 1;};

    // Set longer sampling time for VREFINT
    LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_VREFINT, LL_ADC_SAMPLINGTIME_480CYCLES);

    // Sample VREFINT multiple times for accuracy
    uint32_t sum = 0;
    const uint8_t num_samples = 30;

    //Discard first sample

    adc1_Sample_Single_Channel_Temporary(LL_ADC_CHANNEL_VREFINT);
    for (int i = 0; i < num_samples; i++) {
        sum += adc1_Sample_Single_Channel_Temporary(LL_ADC_CHANNEL_VREFINT);
    }
    uint32_t inRef_div_adcRef = sum / num_samples;

    h->internal_ref_V = (*VREFIN_CAL_ADDR / (float)((1<<ELDRIVER_MC3P_ADCRES) - 1) ) * VREFIN_CAL_VOLTAGE;

    // Calculate actual ADC reference voltage (your supply voltage)
    (h->adc_ref_V) = h->internal_ref_V * ((1<<ELDRIVER_MC3P_ADCRES) - 1) / (float)inRef_div_adcRef;
    #else 

    adc_ref_V = externalRefVoltage_V;
    #endif

    (h->adc_to_uV) = (float)(h->adc_ref_V * 1000000 ) / (float)((1<<ELDRIVER_MC3P_ADCRES) - 1);
}


void mc3p_adc_init(eldriver_mc3p_t *h)
{
        __HAL_RCC_ADC1_CLK_ENABLE();
    LL_ADC_CommonInitTypeDef adc1CommonInitStruct = {
        .CommonClock = LL_ADC_CLOCK_SYNC_PCLK_DIV2
        #ifdef LL_ADC_MULTI_INDEPENDENT
        .Multimode = LL_ADC_MULTI_INDEPENDENT,
        .MultiDMATransfer = LL_ADC_MULTI_REG_DMA_EACH_ADC,
        .MultiTwoSamplingDelay = LL_ADC_MULTI_TWOSAMPLINGDELAY_5CYCLES
        #endif
    };

    LL_ADC_InitTypeDef adc1InitStruct = {
        .Resolution = LL_ADC_RESOLUTION_12B,
        .DataAlignment = LL_ADC_DATA_ALIGN_RIGHT,
        .SequencersScanMode = LL_ADC_SEQ_SCAN_ENABLE
    };

